SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28b210f1024im68.h
/* Part number capabilities */
#define ACMP_PRESENT                               /** ACMP is available in this part */
#define ACMP_COUNT                               2 /** 2 ACMPs available  */
#define BURAM_PRESENT                              /** BURAM is available in this part */
#define BURAM_COUNT                              1 /** 1 BURAMs available  */
#define BURTC_PRESENT                              /** BURTC is available in this part */
#define BURTC_COUNT                              1 /** 1 BURTCs available  */
#define CMU_PRESENT                                /** CMU is available in this part */
#define CMU_COUNT                                1 /** 1 CMUs available  */
#define DCDC_PRESENT                               /** DCDC is available in this part */
#define DCDC_COUNT                               1 /** 1 DCDCs available  */
#define DMEM_PRESENT                               /** DMEM is available in this part */
#define DMEM_COUNT                               1 /** 1 DMEMs available  */
#define DPLL_PRESENT                               /** DPLL is available in this part */
#define DPLL_COUNT                               1 /** 1 DPLLs available  */
#define EMU_PRESENT                                /** EMU is available in this part */
#define EMU_COUNT                                1 /** 1 EMUs available  */
#define EUSART_PRESENT                             /** EUSART is available in this part */
#define EUSART_COUNT                             3 /** 3 EUSARTs available  */
#define FSRCO_PRESENT                              /** FSRCO is available in this part */
#define FSRCO_COUNT                              1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                              /** GPCRC is available in this part */
#define GPCRC_COUNT                              1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                               /** GPIO is available in this part */
#define GPIO_COUNT                               1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                              /** HFRCO is available in this part */
#define HFRCO_COUNT                              1 /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                          /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                          1 /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                               /** HFXO is available in this part */
#define HFXO_COUNT                               1 /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT                        /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT                        1 /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT                                /** I2C is available in this part */
#define I2C_COUNT                                2 /** 2 I2Cs available  */
#define IADC_PRESENT                               /** IADC is available in this part */
#define IADC_COUNT                               1 /** 1 IADCs available  */
#define ICACHE_PRESENT                             /** ICACHE is available in this part */
#define ICACHE_COUNT                             1 /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT                            /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT                            1 /** 1 KEYSCANs available  */
#define LCD_PRESENT                                /** LCD is available in this part */
#define LCD_COUNT                                1 /** 1 LCDs available  */
#define LDMA_PRESENT                               /** LDMA is available in this part */
#define LDMA_COUNT                               1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                           /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                           1 /** 1 LDMAXBARs available  */
#define LESENSE_PRESENT                            /** LESENSE is available in this part */
#define LESENSE_COUNT                            1 /** 1 LESENSEs available  */
#define LETIMER_PRESENT                            /** LETIMER is available in this part */
#define LETIMER_COUNT                            1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                              /** LFRCO is available in this part */
#define LFRCO_COUNT                              1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                               /** LFXO is available in this part */
#define LFXO_COUNT                               1 /** 1 LFXOs available  */
#define MSC_PRESENT                                /** MSC is available in this part */
#define MSC_COUNT                                1 /** 1 MSCs available  */
#define MVP_PRESENT                                /** MVP is available in this part */
#define MVP_COUNT                                1 /** 1 MVPs available  */
#define PCNT_PRESENT                               /** PCNT is available in this part */
#define PCNT_COUNT                               1 /** 1 PCNTs available  */
#define PRS_PRESENT                                /** PRS is available in this part */
#define PRS_COUNT                                1 /** 1 PRSs available  */
#define SCRATCHPAD_PRESENT                         /** SCRATCHPAD is available in this part */
#define SCRATCHPAD_COUNT                         1 /** 1 SCRATCHPADs available  */
#define SEMAILBOX_PRESENT                          /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                          1 /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                /** SMU is available in this part */
#define SMU_COUNT                                1 /** 1 SMUs available  */
#define SYSCFG_PRESENT                             /** SYSCFG is available in this part */
#define SYSCFG_COUNT                             1 /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT                             /** SYSRTC is available in this part */
#define SYSRTC_COUNT                             1 /** 1 SYSRTCs available  */
#define TIMER_PRESENT                              /** TIMER is available in this part */
#define TIMER_COUNT                              5 /** 5 TIMERs available  */
#define ULFRCO_PRESENT                             /** ULFRCO is available in this part */
#define ULFRCO_COUNT                             1 /** 1 ULFRCOs available  */
#define USART_PRESENT                              /** USART is available in this part */
#define USART_COUNT                              1 /** 1 USARTs available  */
#define VDAC_PRESENT                               /** VDAC is available in this part */
#define VDAC_COUNT                               1 /** 1 VDACs available  */
#define WDOG_PRESENT                               /** WDOG is available in this part */
#define WDOG_COUNT                               2 /** 2 WDOGs available  */
#define DEVINFO_PRESENT                            /** DEVINFO is available in this part */
#define DEVINFO_COUNT                            1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
#include "core_cm33.h"        /* Core Header File */
#include "system_efm32pg28.h" /* System Header File */

/** @} End of group EFM32PG28B210F1024IM68_Part */

/**************************************************************************//**
 * @defgroup EFM32PG28B210F1024IM68_Peripheral_TypeDefs EFM32PG28B210F1024IM68 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efm32pg28_scratchpad.h"
#include "efm32pg28_emu.h"
#include "efm32pg28_cmu.h"
#include "efm32pg28_hfrco.h"
#include "efm32pg28_fsrco.h"
#include "efm32pg28_dpll.h"
#include "efm32pg28_lfxo.h"
#include "efm32pg28_lfrco.h"
#include "efm32pg28_ulfrco.h"
#include "efm32pg28_msc.h"
#include "efm32pg28_icache.h"
#include "efm32pg28_prs.h"
#include "efm32pg28_gpio.h"
#include "efm32pg28_ldma.h"
#include "efm32pg28_ldmaxbar.h"
#include "efm32pg28_timer.h"
#include "efm32pg28_usart.h"
#include "efm32pg28_burtc.h"
#include "efm32pg28_i2c.h"
#include "efm32pg28_syscfg.h"
#include "efm32pg28_buram.h"
#include "efm32pg28_gpcrc.h"
#include "efm32pg28_dcdc.h"
#include "efm32pg28_mailbox.h"
#include "efm32pg28_eusart.h"
#include "efm32pg28_sysrtc.h"
#include "efm32pg28_lcd.h"
#include "efm32pg28_keyscan.h"
#include "efm32pg28_mpahbram.h"
#include "efm32pg28_smu.h"
#include "efm32pg28_letimer.h"
#include "efm32pg28_iadc.h"
#include "efm32pg28_acmp.h"
#include "efm32pg28_vdac.h"
#include "efm32pg28_pcnt.h"
#include "efm32pg28_lesense.h"
#include "efm32pg28_hfxo.h"
#include "efm32pg28_wdog.h"
#include "efm32pg28_semailbox.h"
#include "efm32pg28_mvp.h"
#include "efm32pg28_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "efm32pg28_prs_signals.h"
#include "efm32pg28_dma_descriptor.h"
#include "efm32pg28_ldmaxbar_defines.h"

